stubs/libxml2/samples/8cb9350cca5e3cf0a4b6afd3fb381cb0dc61ffa3

<log toolkit="axis_13" examples="http://www.w3.org/2002/ws/databinding/examples/6/09/" xmlns="http://www.w3.org/2002/ws/databinding/log/6/09/" xmlns:ex="*invalid*">
<call example="DocumentationElement" instance="DocumentationElement01">
	<request>
		<head><![CDATA[
		]]>
		</head>
		<body>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:enc="http://schemas.xmlsoap.org/soap/encoding/"	xmlns:xsd="http://www.w3.org/2001/XMLSchema"	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"> <env:Body><!--                                        Copyright (C) 2006 W3C (R) (MIT ERCIM Keio), All Rights Reserved.                    W3C liability, trademark and document use rules apply.                                        http://www.w3.org/Consortium/Legal/ipr-notice                    http://www.w3.org/Consortium/Legal/copyright-documents                    		    $Id: output.xml,v 1.11 2008/02/25 12:00:41 gcowe Exp $--><ex:echoDocumentationElement xmlns:ex="http://www.w3.org/2002/ws/databinding/examples/6/09/">   <ex:documentationElement xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"                            xmlns:xs="http://www.w3.org/2001/XMLSchema"                            xmlns:wsdl11="http://schemas.xmlsoap.org/wsdl/"                            xmlns:soap11enc="http://schemas.xmlsoap.org/soap/encoding/">hello world</ex:documentationElement></ex:echoDocumentationElement></env:Body></env:Envelope>
		</body>
	</request>
	<response>
		<head><![CDATA[
null: [HTTP/1.1 200 OK]
X-AspNet-Version: [2.0.50727]
Date: [Mon, 25 Feb 2008 11:49:27 GMT]
Content-Length: [416]
Content-Type: [text/xml; charset=utf-8]
Server: [Microsoft-IIS/5.1]
X-Powered-By: [ASP.NET]
Cache-Control: [private, max-age=0]
		]]>
		</head>
		<body>
<?_xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><echoDocumentationElement xmlns="http://www.w3.org/2002/ws/databinding/examples/6/09/"><documentationElement>hello world</documentationElement></echoDocumentationElement></soap:Body></soap:Envelope>
		</body>
	</response>
</call>
<call example="IdentifierName" instance="IdentifierName02">
	<request>
		<head><![CDATA[
		]]>
		</head>
		<body>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:enc="http://schemas.xmlsoap.org/soap/encoding/"	xmlns:xsd="http://www.w3.org/2001/XMLSchema"	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"> <env:Body><!--                                        Copyright (C) 2006 W3C (R) (MIT ERCIM Keio), All Rights Reserved.                    W3C liability, trademark and document use rules apply.                                        http://www.w3.org/Consortium/Legal/ipr-notice                    http://www.w3.org/Consortium/Legal/copyright-documents                    		    $Id: output.xml,v 1.11 2008/02/25 12:00:41 gcowe Exp $--><ex:echoIdentifierName xmlns:ex="http://www.w3.org/2002/ws/databinding/examples/6/09/">   <ex:identifierName xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"                      xmlns:xs="http://www.w3.org/2001/XMLSchema"                      xmlns:wsdl11="http://schemas.xmlsoap.org/wsdl/"                      xmlns:soap11enc="http://schemas.xmlsoap.org/soap/encoding/">Hello</ex:identifierName></ex:echoIdentifierName></env:Body></env:Envelope>
		</body>
	</request>
	<response>
		<head><![CDATA[
null: [HTTP/1.1 200 OK]
X-AspNet-Version: [2.0.50727]
Date: [Mon, 25 Feb 2008 11:49:27 GMT]
Content-Length: [386]
Content-Type: [text/xml; charset=utf-8]
Server: [Microsoft-IIS/5.1]
X-Powered-By: [ASP.NET]
Cache-Control: [private, max-age=0]
		]]>
		</head>
		<body>
<?_xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><echoIdentifierName xmlns="http://www.w3.org/2002/ws/databinding/examples/6/09/"><identifierName>Hello</identifierName></echoIdentifierName></soap:Body></soap:Envelope>
		</body>
	</response>
</call>
<call example="NonIdentifierName" instance="NonIdentifierName02">
	<request>
		<head><![CDATA[
		]]>
		</head>
		<body>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:enc="http://schemas.xmlsoap.org/soap/encoding/"	xmlns:xsd="http://www.w3.org/2001/XMLSchema"	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"> <env:Body><!--                                        Copyright (C) 2006 W3C (R) (MIT ERCIM Keio), All Rights Reserved.                    W3C liability, trademark and document use rules apply.                                        http://www.w3.org/Consortium/Legal/ipr-notice                    http://www.w3.org/Consortium/Legal/copyright-documents                    		    $Id: output.xml,v 1.11 2008/02/25 12:00: